RT-Thread/rt-thread/bsp/hc32/libraries/hc32f448_ddl/cmsis/Device/HDSC/hc32f4xx/Include/hc32f448.h
typedef struct {
    stc_hash_cr_bit_t                        CR_b;
} bCM_HASH_TypeDef;

typedef struct {
    stc_i2c_cr1_bit_t                        CR1_b;
    stc_i2c_cr2_bit_t                        CR2_b;
    stc_i2c_cr3_bit_t                        CR3_b;
    stc_i2c_cr4_bit_t                        CR4_b;
    stc_i2c_slr0_bit_t                       SLR0_b;
    stc_i2c_slr1_bit_t                       SLR1_b;
    uint32_t                                 RESERVED0[32];
    stc_i2c_sr_bit_t                         SR_b;
    stc_i2c_clr_bit_t                        CLR_b;
    uint32_t                                 RESERVED1[96];
    stc_i2c_fltr_bit_t                       FLTR_b;
    stc_i2c_fstr_bit_t                       FSTR_b;
} bCM_I2C_TypeDef;

typedef struct {
    stc_icg_icg0_bit_t                       ICG0_b;
    stc_icg_icg1_bit_t                       ICG1_b;
} bCM_ICG_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[32];
    stc_intc_nmier_bit_t                     NMIER_b;
    stc_intc_nmifr_bit_t                     NMIFR_b;
    stc_intc_nmifcr_bit_t                    NMIFCR_b;
    stc_intc_eirqcr_bit_t                    EIRQCR0_b;
    stc_intc_eirqcr_bit_t                    EIRQCR1_b;
    stc_intc_eirqcr_bit_t                    EIRQCR2_b;
    stc_intc_eirqcr_bit_t                    EIRQCR3_b;
    stc_intc_eirqcr_bit_t                    EIRQCR4_b;
    stc_intc_eirqcr_bit_t                    EIRQCR5_b;
    stc_intc_eirqcr_bit_t                    EIRQCR6_b;
    stc_intc_eirqcr_bit_t                    EIRQCR7_b;
    stc_intc_eirqcr_bit_t                    EIRQCR8_b;
    stc_intc_eirqcr_bit_t                    EIRQCR9_b;
    stc_intc_eirqcr_bit_t                    EIRQCR10_b;
    stc_intc_eirqcr_bit_t                    EIRQCR11_b;
    stc_intc_eirqcr_bit_t                    EIRQCR12_b;
    stc_intc_eirqcr_bit_t                    EIRQCR13_b;
    stc_intc_eirqcr_bit_t                    EIRQCR14_b;
    stc_intc_eirqcr_bit_t                    EIRQCR15_b;
    stc_intc_wken_bit_t                      WKEN_b;
    stc_intc_eifr_bit_t                      EIFR_b;
    stc_intc_eifcr_bit_t                     EIFCR_b;
    uint32_t                                 RESERVED1[1024];
    stc_intc_swier_bit_t                     SWIER_b;
    stc_intc_evter_bit_t                     EVTER_b;
    stc_intc_ier_bit_t                       IER_b;
} bCM_INTC_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[32];
    stc_keyscan_ser_bit_t                    SER_b;
} bCM_KEYSCAN_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[96];
    stc_mcan_dbtp_bit_t                      DBTP_b;
    stc_mcan_test_bit_t                      TEST_b;
    uint32_t                                 RESERVED1[32];
    stc_mcan_cccr_bit_t                      CCCR_b;
    uint32_t                                 RESERVED2[96];
    stc_mcan_tocc_bit_t                      TOCC_b;
    uint32_t                                 RESERVED3[160];
    stc_mcan_ecr_bit_t                       ECR_b;
    stc_mcan_psr_bit_t                       PSR_b;
    uint32_t                                 RESERVED4[64];
    stc_mcan_ir_bit_t                        IR_b;
    stc_mcan_ie_bit_t                        IE_b;
    stc_mcan_ils_bit_t                       ILS_b;
    stc_mcan_ile_bit_t                       ILE_b;
    uint32_t                                 RESERVED5[256];
    stc_mcan_gfc_bit_t                       GFC_b;
    uint32_t                                 RESERVED6[128];
    stc_mcan_hpms_bit_t                      HPMS_b;
    stc_mcan_ndat1_bit_t                     NDAT1_b;
    stc_mcan_ndat2_bit_t                     NDAT2_b;
    stc_mcan_rxf0c_bit_t                     RXF0C_b;
    stc_mcan_rxf0s_bit_t                     RXF0S_b;
    uint32_t                                 RESERVED7[64];
    stc_mcan_rxf1c_bit_t                     RXF1C_b;
    stc_mcan_rxf1s_bit_t                     RXF1S_b;
    uint32_t                                 RESERVED8[64];
    stc_mcan_txbc_bit_t                      TXBC_b;
    stc_mcan_txfqs_bit_t                     TXFQS_b;
    uint32_t                                 RESERVED9[32];
    stc_mcan_txbrp_bit_t                     TXBRP_b;
    stc_mcan_txbar_bit_t                     TXBAR_b;
    stc_mcan_txbcr_bit_t                     TXBCR_b;
    stc_mcan_txbto_bit_t                     TXBTO_b;
    stc_mcan_txbcf_bit_t                     TXBCF_b;
    stc_mcan_txbtie_bit_t                    TXBTIE_b;
    stc_mcan_txbcie_bit_t                    TXBCIE_b;
    uint32_t                                 RESERVED10[96];
    stc_mcan_txefs_bit_t                     TXEFS_b;
} bCM_MCAN_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[512];
    stc_mpu_sr_bit_t                         SR_b;
    stc_mpu_eclr_bit_t                       ECLR_b;
    stc_mpu_wp_bit_t                         WP_b;
    stc_mpu_ippr_bit_t                       IPPR_b;
    uint32_t                                 RESERVED1[32];
    stc_mpu_msppctl_bit_t                    MSPPCTL_b;
    uint32_t                                 RESERVED2[32];
    stc_mpu_psppctl_bit_t                    PSPPCTL_b;
    stc_mpu_srge_bit_t                       S1RGE_b;
    stc_mpu_srgwp_bit_t                      S1RGWP_b;
    stc_mpu_srgrp_bit_t                      S1RGRP_b;
    stc_mpu_scr_bit_t                        S1CR_b;
    stc_mpu_srge_bit_t                       S2RGE_b;
    stc_mpu_srgwp_bit_t                      S2RGWP_b;
    stc_mpu_srgrp_bit_t                      S2RGRP_b;
    stc_mpu_scr_bit_t                        S2CR_b;
} bCM_MPU_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[96];
    stc_peric_smc_enar_bit_t                 SMC_ENAR_b;
    uint32_t                                 RESERVED1[32];
    stc_peric_tmr_synenr_bit_t               TMR_SYNENR_b;
    uint32_t                                 RESERVED2[32];
    stc_peric_usart1_nfc_bit_t               USART1_NFC_b;
} bCM_PERIC_TypeDef;

